import datetime


class DailyLuck:
    def __init__(self, user_id):
        self.today = datetime.datetime.today()
        self.iday = self.today.year * 10000 + (self.today.month * 100) + self.today.day
        self.user_id = user_id if user_id is not None else 0

        self.weeks = ["一", "二", "三", "四", "五", "六", "日"]
        self.directions = ["北方", "东北方", "东方", "东南方", "南方", "西南方", "西方", "西北方"]
        self.activities = self.load_activities()
        self.specials = [{}]
        self.tools = []
        self.varNames = []
        self.spaces = self.load_spaces()
        self.ships = self.load_ships()

        self.today_str = self.get_today_string()
        self.direction = self.directions[self.random_custom(self.iday, 2) % len(self.directions)]
        self.chosen_ships = ', '.join(self.pick_random(self.ships, 3))
        self.chosen_spaces = ', '.join(self.pick_random(self.spaces, 2))
        self.goddess_value = self.random_custom(self.iday, 6) % 50 / 10.0
        self.good_events, self.bad_events = self.pick_todays_luck()

    def random_custom(self, dayseed, indexseed):
        # 加入用户ID影响随机结果
        user_id_num = hash(self.user_id) % 10000
        n = (dayseed + user_id_num) % 11117
        for i in range(100 + indexseed):
            n = (n * n) % 11113
        return n

    @staticmethod
    def load_activities():
        return [
            {"name": "高安任务", "good": "全出腹背受敌", "bad": "拉暴动被反跳掉线"},
            {"name": "刷异常", "good": "传说一跳破100m", "bad": "刚拉暴动就断网"},
            {"name": "蹲站", "good": "今天POE2更新版本", "bad": "错过嗜血发福利"},
            {"name": "挖矿", "good": "矿涨价比房价还快", "bad": "红星蹲驻地星门了"},
            {"name": "挖冰", "good": "小鲸鱼高安挂机，突出一个安逸", "bad": "啥？怎么又被三哥打成低安了？"},
            {"name": "打萨沙", "good": "统合部LP又涨价了", "bad": "INIT又来了"},
            {"name": "虫洞", "good": "闭着眼睛数钱", "bad": "宝船赠与有缘人"},
            {"name": "翻合同", "good": "有人填错数字，赚到了", "bad": "手一抖买了个寡妇"},
            {"name": "纤维", "good": "路上捡了个空堡", "bad": "你蛋没了"},
            {"name": "多开", "good": "横扫故土不解释", "bad": "不小心打到自己被筒子部端了"},
            {"name": "T1制造", "good": "卖给新人赚一个是一个", "bad": "真当新人不会玩制造啊"},
            {"name": "会战", "good": "怒抓一条泰坦", "bad": "互蹲星门到半夜下线"},
            {"name": "堵门", "good": "有人运一船PLEX自动导航", "bad": "蹲一晚上秒睡了然后损了"},
            {"name": "吃肉", "good": "又有YST秒睡了", "bad": "那个恶狼是永动装肉"},
            {"name": "考古", "good": "挖了一船高统", "bad": "碳，碳，又TM是碳"},
            {"name": "KFC", "good": "全家桶网上订餐有优惠", "bad": "总监要查账"},
            {"name": "低安任务", "good": "本地就一人简直开心", "bad": "遇一隐轰，船蛋双飞"},
            {"name": "跑货", "good": "这个时间没人抓你", "bad": "出门就被堵死了"},
            {"name": "刷死亡", "good": "PA全家桶", "bad": "你打死亡不就为了盒子吗"},
            {"name": "T2制造", "good": "知道啥叫出货战争吗", "bad": "制造毁一生"},
            {"name": "拆迁", "good": "壮哉我多炮塔神教", "bad": "POS是空的"},
            {"name": "守官员", "good": "AMM全抗妥妥的", "bad": "好绿的恐惧怪"},
            {"name": "偷运", "good": "炒鸡物流高效直达", "bad": "炒鸡你的货柜怎么空空的"},
            {"name": "收割", "good": "刺客solo小克", "bad": "怎么全在挂靠"},
            {"name": "打捞", "good": "就是要捞出一艘泰坦的男人啊", "bad": "突然刷个怪没看见，损"},
            {"name": "低安观光", "good": "海盗都没起床", "bad": "白名诱导怎么在脸上"},
            {"name": "00观光", "good": "走遍全宇宙", "bad": "被炸回家了"},
            {"name": "高安宣战", "good": "又有新鲜的肉啦", "bad": "被疯狂的新人围剿"},
            {"name": "带路", "good": "sir, this way", "bad": "我巨蟒呢"},
            {"name": "行星开发", "good": "一片茫茫白色区", "bad": "辛苦半天不如别人一顿KFC"},
            {"name": "发明", "good": "10条线红了9条，还都是N流程的", "bad": "我图呢"},
            {"name": "伐木运货", "good": "堵门党没上班", "bad": "COSPLAY 🐖"},
            {"name": "挖气云", "good": "低调的暴利行业", "bad": "没人买药"},
            {"name": "深渊", "good": "一趟十亿不是梦", "bad": "“毒蜥，我的毒蜥”"},
            {"name": "装备突变", "good": "一号官员有我强？", "bad": "醒醒，工头叫你搬砖了"},
            {"name": "深渊竞技场", "good": "大吉大利，今晚吃鸡", "bad": "我在哪儿？谁在打我？我怎么死了"},
            {"name": "绕杆子", "good": "闷声发大财", "bad": "卫队LP被压成这样还绕个蛋"},
            {"name": "泡语音", "good": "哟，萌妹子", "bad": "给新人讲解了半天对方表示刚睡着了"},
            {"name": "DOTA2", "good": "妹子放一边，基友围一圈", "bad": "注定孤独一生"},
            {"name": "FF14", "good": "坐骑队，进组，ROLL点，99", "bad": "为什么中间有激光扫过啊啊啊啊啊啊啊"},
            {"name": "坦克世界", "good": "我们击穿了对方装甲", "bad": "误国"},
            {"name": "挺针队", "good": "0封光头", "bad": "我怎么开的回转Ved"},
            {"name": "扫货", "good": "版本千里眼财富密码", "bad": "PLEX又跌了"},
            {"name": "贴吧", "good": "贴吧才是本体", "bad": "别水了，再水结构都要没了"},
            {"name": "炒货", "good": "水硼砂我会乱说？", "bad": "还轮得到你么"},
            {"name": "B站", "good": "专注新番三十年", "bad": "切回来就只剩蛋了"},
            {"name": "原神启动", "good": "单抽出奇迹", "bad": "648没了"},
            {"name": "水中文", "good": "水也是一门艺术", "bad": "又忘了把本地拉出来了"},
        ]

    @staticmethod
    def load_spaces():
        return ['血脉', '德克廉', '斐德', '对舞之域', '黑渊', '特纳', '特布特', '静寂谷',
                '维纳尔', '地窖', '卡彻', '柯尔斯', '底特里德', '埃索特亚', '非塔波利斯', '大荒野',
                '伊梅瑟亚', '绝径', '因斯姆尔', '欧米斯特', '摄魂之域', '普罗维登斯', '灼热之径', '混浊',
                '特里菲斯',
                '邪恶湾流', '云环', '绝地之域', '源泉之域', '外环', '贝斯', '逑瑞斯', '辛迪加',
                '域外走廊',
                '琉蓝之穹', '卡勒瓦拉阔地', '欧莎', '钴蓝边域', '糟粕之域', '佩利根弗', '螺旋之域']

    @staticmethod
    def load_ships():
        return ["分裂者级", "爆发级", "探索级", "裂谷级", "伐木者级", "守夜者级", "阿特龙级", "伊米卡斯级",
                "因卡萨斯级",
                "毛鲁斯级", "纳维达斯级", "特里斯坦级", "磨难级", "刽子手级", "检察官级", "惩罚者级", "巨神兵级",
                "矮脚鸡级",
                "秃鹫级", "狮鹫级", "苍鹭级", "茶隼级", "小鹰级", "利爪级", "短剑级", "阿瑞斯级", "塔纳尼斯级",
                "十字军级",
                "咒灭级", "黑鸦级", "猛禽级", "美洲虎级", "猎狼级", "恩尤级", "伊什库尔级", "审判者级", "复仇级",
                "女妖级",
                "战鹰级", "猎豹级", "猎犬级", "太阳神级", "纳美西斯级", "咒逐级", "净化级", "秃鹰级", "蝎尾怪级",
                "土狼级",
                "克勒斯级", "哨兵级", "斯芬尼克斯级", "长尾鲛级", "促进级", "强制者级", "海燕级", "剑齿虎级",
                "厄里斯级",
                "异端级", "飞燕级", "挑战级", "断崖级", "镰刀级", "刺客级", "星空级", "送葬者级", "托勒克斯级",
                "狂怒者级",
                "主宰级", "奥格诺级", "林荫级", "启示级", "黑鸟级", "狞獾级", "巨鸟级", "鱼鹰级", "休津级", "长剑级",
                "埃拉兹级", "拉克希斯级", "诅咒级", "朝圣级", "战隼级", "白嘴鸦级", "阔刀级", "伏波斯级", "奉献级",
                "奥尼克斯级", "缪宁级", "流浪级", "戴默斯级", "伊什塔级", "渎圣级", "狂热级", "希尔博拉斯级", "银鹰级",
                "曲剑级", "奥内罗斯级", "守卫级", "皇冠蜥级", "飓风级", "暴风级", "布鲁提克斯级", "弥洱米顿级",
                "先知级",
                "先驱者级", "猛鲑级", "幼龙级", "月刃级", "斯雷普尼级", "阿施塔特级", "曙光女神级", "救赎级", "永灭级",
                "夜鹰级", "兀鹫级", "狂暴级", "台风级", "死亡漩涡级", "多米尼克斯级", "万王宝座级", "亥伯龙神级",
                "灾难级",
                "末日沙场级", "地狱天使级", "乌鸦级", "毒蝎级", "鹏鲲级", "黑豹级", "罪恶级", "救世级", "寡妇级",
                "恶狼级",
                "克洛诺斯级", "帕拉丁级", "魔像级", "拉格纳洛克级", "俄洛巴斯级", "神使级", "勒维亚坦级", "纳迦法级",
                "莫洛级",
                "神示级", "凤凰级", "冥府级", "尼铎格尔级", "夜神级", "绝念级", "万古级", "执政官级", "奇美拉级",
                "飞龙级",
                "巨象级", "徘徊者级", "奥卡托级", "旅行者级", "激进级", "分裂级", "大鸨级", "天鹤级",
                "阿斯特罗级", "斯特修斯级", "涅斯托级", "加姆级", "奥苏斯级", "巴盖斯级", "达玛维克级", "奇奇莫拉级",
                "维德马克级", "德雷卡瓦级", "勒沙克级"]

    def get_today_string(self):
        return f"今天是 {self.today.year}年{self.today.month}月{self.today.day}日 星期{self.weeks[self.today.weekday()]}"

    def pick_todays_luck(self):
        num_good = self.random_custom(self.iday, 98) % 3 + 2
        num_bad = self.random_custom(self.iday, 87) % 3 + 2
        event_arr = self.pick_random_activity(num_good + num_bad)

        good_events = event_arr[:num_good]
        bad_events = event_arr[num_good:num_good + num_bad]

        return good_events, bad_events

    def pick_random_activity(self, size):
        picked_events = self.pick_random(self.activities, size)
        return [self.parse(event) for event in picked_events]

    def pick_random(self, array, size):
        result = list(array)
        for j in range(len(array) - size):
            index = self.random_custom(self.iday, j) % len(result)
            result.pop(index)
        return result

    def parse(self, event):
        result = event.copy()
        if '%v' in result['name']:
            result['name'] = result['name'].replace('%v', self.varNames[
                self.random_custom(self.iday, 12) % len(self.varNames)])
        if '%t' in result['name']:
            result['name'] = result['name'].replace('%t',
                                                    self.tools[self.random_custom(self.iday, 11) % len(self.tools)])
        if '%l' in result['name']:
            result['name'] = result['name'].replace('%l', str(self.random_custom(self.iday, 12) % 247 + 30))
        return result

    def get_luck_level(self):
        value = self.goddess_value
        if value >= 4.0:
            return "大吉"
        elif value >= 3.5:
            return "中吉"
        elif value >= 2.5:
            return "小吉"
        elif value >= 1.0:
            return "平平无奇"
        elif value >= 0.5:
            return "小凶"
        else:
            return "大凶"


